/*
  S.O.L.I.D
 1. Single Responsibility Principle (SRP) - Принцип единственной ответственности
  У класса должна быть только одна причина для изменения
 
2. Open-closed principle (OCP) - Принцип открытости/закрытости
    Программные сущности … должны быть открыты для расширения, 
    но закрыты для модификации

3. Liskov Substitution principle (LSP) - Принцип подстановки Лисков
    Функцилнал, которые используют базовый тип, должны иметь возможность 
    использовать подтипы базового типа не зная об этом

4. Interface Segragation principle (ISP) - Принцип разделения интерфейса
    Много интерфейсов, специально предназначенных для клиентов, 
    лучше, чем один интерфейс общего назначения

5. Dependency Inversion principle (DIP) - Принцип инверсии зависимостей
    Зависимость на Абстракциях. Нет зависимости на что-то конкретное

 */
